sailingfree/instruments-guition-esp32-s3/src/display.cpp
    lv_theme_t* theme = NULL;

    lv_disp_t* dispp = lv_disp_get_default();
    theme = lv_theme_default_init(dispp, lv_palette_main(LV_PALETTE_BLUE), lv_palette_main(LV_PALETTE_RED),
                                  false, &RobotoCondensedVariableFont_wght24);

    // theme = lv_theme_mono_init(dispp, false, &lv_font_montserrat_24);
    theme = lv_theme_mono_init(dispp, false, &RobotoCondensedVariableFont_wght32);

    if (theme) {
        lv_disp_set_theme(dispp, theme);
    }

    // Create the boot screen for bootup messages
    screen[SCR_BOOT] = createInfoScreen(SCR_BOOT, "Boot Messages");
    // Create the rest of the screens.
    screen[SCR_ENGINE] = createEngineScreen(SCR_ENGINE);
    screen[SCR_NAV] = createNavScreen(SCR_NAV);
    screen[SCR_GNSS] = createGNSSScreen(SCR_GNSS);
    screen[SCR_ENV] = createEnvScreen(SCR_ENV);
    screen[SCR_TRIP] = createTripScreen(SCR_TRIP);
    screen[SCR_NETWORK] = createInfoScreen(SCR_NETWORK, "Network");
    screen[SCR_SYSINFO] = createInfoScreen(SCR_SYSINFO, "System");
    screen[SCR_MSGS] = createInfoScreen(SCR_MSGS, "N2K Messages");
    screen[SCR_SDCARD] = createInfoScreen(SCR_SDCARD, "SD Card");
    screen[SCR_CLOCK] = createClockScreen(SCR_CLOCK);

    // Load the boot screen
    lv_obj_t* startScreen = screen[SCR_BOOT];
    lv_disp_load_scr(startScreen);

    // display some progress
    displayText("Initialising screens...");
}

// create a container for a gauge or other display object
// setting styles etc
static lv_obj_t* createContainer(lv_obj_t* cont) {
    lv_obj_t* container = lv_obj_create(cont);
    return container;
}

static void setupCommonstyles(lv_obj_t* obj) {
    lv_obj_set_style_pad_gap(obj, padding, 0);

    lv_obj_set_height(obj, TFT_HEIGHT);
    lv_obj_set_width(obj, TFT_WIDTH);
    lv_obj_clear_flag(obj, LV_OBJ_FLAG_SCROLLABLE);
}

static void setupHeader(Screens scr, lv_obj_t* screen, const char* title) {
    // Info bar at the tope
    InfoBar* bar = new InfoBar(screen, BAR_ROW_TOP);
    bars[scr] = bar;
    bar->setValue(title);
}

// callbacks for the buttons on the trip computer page
static void tripButton1(lv_event_t* e) {
    tripComputer.tripButton1();
}

static void tripButton2(lv_event_t* e) {
    tripComputer.tripButton2();
}

// Screens for the trip computer
static void setupTripMenu(lv_obj_t* screen) {
    const char* label1 = tripComputer.button1();
    const char* label2 = tripComputer.button2();
    lv_obj_t *b1, *b2;

    MenuBar* menuBar = new MenuBar(screen, BAR_ROW_BOTTOM);
    menuBar->addButton("Home", SCR_ENGINE);
    b1 = menuBar->addActionButton(label1, tripButton1);
    b2 = menuBar->addActionButton(label2, tripButton2);
    menuBar->addButton("Data", SCR_NETWORK);

    // save the buttons in the trip computer
    tripComputer.b1 = b1;
    tripComputer.b2 = b2;
}

static lv_obj_t* createTripScreen(Screens scr) {
    lv_obj_t* screen = lv_obj_create(NULL);
    lv_obj_set_width(screen, TFT_WIDTH);
    lv_obj_set_height(screen, TFT_HEIGHT);
    lv_obj_set_align(screen, LV_ALIGN_CENTER);
    setupCommonstyles(screen);
    setupHeader(scr, screen, "Trip");

    ind[scr][TR_DISTANCE] = new Indicator(screen, "Distance (nm)", COL1, ROW1);
    ind[scr][TR_TIME] = new Indicator(screen, "Time", COL2, ROW1);
    ind[scr][TR_AVGSPEED] = new Indicator(screen, "Avg speed (kts)", COL1, ROW2);
    ind[scr][TR_MAXSPEED] = new Indicator(screen, "Max speed (kts)", COL2, ROW2);
    ind[scr][TR_AVGWIND] = new Indicator(screen, "Avg Wind (kts)", COL1, ROW3);
    ind[scr][TR_MAXWIND] = new Indicator(screen, "Max Wind (kts)", COL2, ROW3);

    setupTripMenu(screen);

    return screen;
}

static void setupMenu(lv_obj_t* screen) {
    MenuBar* menuBar = new MenuBar(screen, BAR_ROW_BOTTOM);
    menuBar->addButton("Eng", SCR_ENGINE);
    menuBar->addButton("Nav", SCR_NAV);
    menuBar->addButton("GPS", SCR_GNSS);
    menuBar->addButton("TRP", SCR_TRIP);
    menuBar->addButton("Env", SCR_ENV);
    menuBar->addButton("Data", SCR_NETWORK);
}

static void setupDataMenu(lv_obj_t* screen) {
    MenuBar* menuBar = new MenuBar(screen, BAR_ROW_BOTTOM);
    menuBar->addButton("Home", SCR_ENGINE);
    menuBar->addButton("Net", SCR_NETWORK);
    menuBar->addButton("Sys", SCR_SYSINFO);
    menuBar->addButton("Msg", SCR_MSGS);
    menuBar->addButton("SD", SCR_SDCARD);
    menuBar->addButton("Clock", SCR_CLOCK);
}

static lv_obj_t* createEngineScreen(Screens scr) {
    lv_obj_t* screen = lv_obj_create(NULL);

    setupCommonstyles(screen);

    setupHeader(scr, screen, "Engine");

    // Create the indicator panels
    ind[scr][ENG_HOUSEV] = new Indicator(screen, "House Voltage", COL1, ROW1);
    ind[scr][ENG_HOUSEI] = new Indicator(screen, "House Current", COL2, ROW1);
    ind[scr][ENG_ENGINEV] = new Indicator(screen, "Engine Voltage", COL1, ROW2);
    ind[scr][ENG_TEMP] = new Indicator(screen, "Temp", COL1, ROW3);

    // Create a container for a gauge
    lv_obj_t* container = createContainer(screen);
    lv_obj_set_size(container, (TFT_WIDTH / 2) - 2 * padding, (TFT_HEIGHT / 2) - 2 * padding);
    lv_obj_set_pos(container, COL2, ROW2);
    lv_obj_clear_flag(container, LV_OBJ_FLAG_SCROLLABLE);

    // Meter for the RPM
    lv_obj_t* scale = lv_scale_create(container);

    lv_obj_set_size(scale, (METER_RADIUS * 2) - (2 * padding) - (2 * border), (METER_RADIUS * 2) - (2 * padding) - (2 * border));
    lv_scale_set_mode(scale, LV_SCALE_MODE_ROUND_INNER);
    lv_obj_set_style_bg_opa(scale, LV_OPA_80, 0);
    lv_obj_set_style_bg_color(scale, lv_color_black(), 0);
    lv_obj_set_style_radius(scale, LV_RADIUS_CIRCLE, 0);
    lv_obj_set_style_clip_corner(scale, true, 0);
    lv_obj_center(scale);

    static lv_style_t indicator_style;
    lv_style_init(&indicator_style);

    /* Label style properties */
    lv_style_set_text_font(&indicator_style, &RobotoCondensedVariableFont_wght24);
    lv_style_set_text_color(&indicator_style, lv_palette_main(LV_PALETTE_YELLOW));

    /* Major tick properties */
    lv_style_set_line_color(&indicator_style, lv_palette_main(LV_PALETTE_YELLOW));
    lv_style_set_length(&indicator_style, METER_TICK_LENGTH);     /* tick length */
    lv_style_set_line_width(&indicator_style, 2); /* tick width */
    lv_obj_add_style(scale, &indicator_style, LV_PART_INDICATOR);

