sailingfree/instruments-guition-esp32-s3/src/display.cpp
    static const char* rpm_ticks[] = {"0", "5", "10", "15", "20", "25", "30", "35"};
    lv_scale_set_text_src(scale, rpm_ticks);
    lv_scale_set_label_show(scale, true);
    lv_scale_set_total_tick_count(scale, 31);
    lv_scale_set_major_tick_every(scale, 5);

    lv_obj_set_style_length(scale, 5, LV_PART_ITEMS);
    lv_obj_set_style_length(scale, 10, LV_PART_INDICATOR);
    lv_scale_set_range(scale, 1, 3500);

    lv_scale_set_angle_range(scale, 270);
    lv_scale_set_rotation(scale, 135);

    static lv_style_t scale_style;
    lv_style_init(&scale_style);
    lv_style_set_line_width(&scale_style, 6);

    lv_obj_add_style(scale, &scale_style, LV_PART_ANY);

    lv_obj_t* needle = lv_image_create(scale);
    needle = lv_line_create(scale);
    lv_obj_set_style_line_width(needle, 5, 0);
    lv_obj_set_style_line_rounded(needle, true, 0);
    lv_obj_set_style_line_color(needle, lv_palette_main(LV_PALETTE_RED), 0);


    // Label in the dial
    const char* lab = "RPM x100";
    lv_obj_t* label = lv_label_create(scale);
    lv_label_set_text(label, lab);

    lv_obj_set_style_text_font(label, &RobotoCondensedVariableFont_wght16, 0);
    lv_obj_set_style_text_color(label, lv_palette_main(LV_PALETTE_YELLOW), 0);
    lv_obj_set_style_text_align(label, LV_TEXT_ALIGN_CENTER, 0);
    uint32_t w = lv_text_get_width(lab, strlen(lab), &RobotoCondensedVariableFont_wght16, 1);
    lv_obj_set_pos(label, TFT_WIDTH / 4 - (w / 2), TFT_HEIGHT / 3);

    // Save the scale line and image for updates
    gauges[scr] = scale;
    needles[scr] = needle;

    setGauge(scr, 10);

    setupMenu(screen);

    return screen;
}

static lv_obj_t* createNavScreen(Screens scr) {
    lv_obj_t* screen = lv_obj_create(NULL);

    setupCommonstyles(screen);
    setupHeader(scr, screen, "Navigation");

    ind[scr][NAV_SOG] = new Indicator(screen, "SOG", COL1, ROW1);
    ind[scr][NAV_DEPTH] = new Indicator(screen, "Depth", COL2, ROW1);
    ind[scr][NAV_COG] = new Indicator(screen, "COG", COL1, ROW2);
    ind[scr][NAV_WIND] = new Indicator(screen, "App Wind", COL1, ROW3);

    // Create a container for a gauge for the Wind
    lv_obj_t* container = createContainer(screen);
    lv_obj_set_size(container, (TFT_WIDTH / 2) - 2 * padding, (TFT_HEIGHT / 2) - 2 * padding);
    lv_obj_set_pos(container, COL2, ROW2);
    lv_obj_clear_flag(container, LV_OBJ_FLAG_SCROLLABLE);

    static lv_style_t style;
    lv_style_init(&style);

    // Scale for the wind direction
    lv_obj_t* scale = lv_scale_create(container);
    lv_obj_set_size(scale, (TFT_WIDTH / 2) - (2 * padding) - (2 * border), (TFT_HEIGHT / 2) - (2 * padding) - (2 * border));
    lv_scale_set_mode(scale, LV_SCALE_MODE_ROUND_INNER);
    lv_obj_set_style_bg_opa(scale, LV_OPA_80, 0);
    lv_obj_set_style_bg_color(scale, lv_color_black(), 0);
    lv_obj_set_style_radius(scale, LV_RADIUS_CIRCLE, 0);
    lv_obj_set_style_clip_corner(scale, true, 0);
    lv_obj_center(scale);

    lv_scale_set_label_show(scale, true);

    lv_scale_set_total_tick_count(scale, 61);
    lv_scale_set_major_tick_every(scale, 5);

    lv_obj_set_style_length(scale, 5, LV_PART_ITEMS);
    lv_obj_set_style_length(scale, 10, LV_PART_INDICATOR);

    lv_scale_set_range(scale, 0, 360);
    lv_scale_set_angle_range(scale, 360);
    lv_scale_set_rotation(scale, 270);

    static lv_style_t indicator_style;
    lv_style_init(&indicator_style);

    /* Label style properties */
    lv_style_set_text_font(&indicator_style, &RobotoCondensedVariableFont_wght24);
    lv_style_set_text_color(&indicator_style, lv_palette_main(LV_PALETTE_YELLOW));

    /* Major tick properties */
    lv_style_set_line_color(&indicator_style, lv_palette_main(LV_PALETTE_YELLOW));
    lv_style_set_length(&indicator_style, METER_TICK_LENGTH);     /* tick length */
    lv_style_set_line_width(&indicator_style, 2); /* tick width */
    lv_obj_add_style(scale, &indicator_style, LV_PART_INDICATOR);

    static const char* compass_ticks[] = {
        "", "30", "60", "90", "120", "150", "180", "210", "240", "270", "300", "330", "360"};
    lv_scale_set_text_src(scale, compass_ticks);

    static lv_style_t scale_style;
    lv_style_init(&scale_style);
    lv_style_set_line_width(&scale_style, 6);

    lv_obj_add_style(scale, &scale_style, LV_PART_ANY);
    lv_obj_t* needle = lv_line_create(scale);

    lv_obj_set_style_line_width(needle, 5, 0);
    lv_obj_set_style_line_rounded(needle, true, 0);
    lv_obj_set_style_line_color(needle, lv_palette_main(LV_PALETTE_RED), 0);

    // Label in the dial
    const char* lab = "App Wind";
    lv_obj_t* label = lv_label_create(scale);
    lv_label_set_text(label, lab);

    lv_obj_set_style_text_font(label, &RobotoCondensedVariableFont_wght24, 0);
    lv_obj_set_style_text_color(label, lv_palette_main(LV_PALETTE_YELLOW), 0);
    lv_obj_set_style_text_align(label, LV_TEXT_ALIGN_CENTER, 0);
    uint32_t w = lv_text_get_width(lab, strlen(lab), &RobotoCondensedVariableFont_wght24, 1);
    lv_obj_set_pos(label, TFT_WIDTH / 4 - (w / 2), TFT_HEIGHT / 3);

    // Save the scale line and image for updates
    gauges[scr] = scale;
    needles[scr] = needle;

    setGauge(scr, 0);

    setupMenu(screen);

    return screen;
}

// Screen for the GNSS status and info
static lv_obj_t* createGNSSScreen(Screens scr) {
    lv_obj_t* screen = lv_obj_create(NULL);
    setupCommonstyles(screen);
    setupHeader(scr, screen, "GPS");

    ind[scr][GNSS_HDOP] = new Indicator(screen, "HDOP", COL1, ROW1);
    ind[scr][GNSS_SATS] = new Indicator(screen, "Satellites", COL2, ROW1);
    ind[scr][GNSS_LAT_DEGS] = new Indicator(screen, "LAT DD.MM", COL1, ROW2);
    ind[scr][GNSS_LON_DEGS] = new Indicator(screen, "LON DD.MM", COL2, ROW2);
    ind[scr][GNSS_SOG] = new Indicator(screen, "SOG", COL1, ROW3);
    ind[scr][GNSS_COG] = new Indicator(screen, "COG", COL2, ROW3);

    // Reduce the font size for the lat/lon
    ind[scr][GNSS_LAT_DEGS]->setFont(&RobotoCondensedVariableFont_wght52);
    ind[scr][GNSS_LON_DEGS]->setFont(&RobotoCondensedVariableFont_wght52);

    setupMenu(screen);
    return screen;
}

// Screen for the environmental status and info
static lv_obj_t* createEnvScreen(Screens scr) {
    lv_obj_t* screen = lv_obj_create(NULL);
    setupCommonstyles(screen);
    setupHeader(scr, screen, "Environment");

    // Info bar at the top
    //    bars[scr][0] = new InfoBar(screen);

    ind[scr][0] = new Indicator(screen, "Air Temp", COL1, ROW1);
    ind[scr][1] = new Indicator(screen, "Humidity", COL1, ROW2);
    ind[scr][2] = new Indicator(screen, "Pressure", COL1, ROW3);
    ind[scr][3] = new Indicator(screen, "Sea Temp", COL2, ROW1);
    ind[scr][4] = new Indicator(screen, "Wind Speed", COL2, ROW2);
    ind[scr][5] = new Indicator(screen, "Apparent Wind", COL2, ROW3);

