sailingfree/instruments-guition-esp32-s3/src/display.cpp
    //    // Info bar at the bottom
    //    bars[scr][0] = new InfoBar(screen);
    setupMenu(screen);
    return screen;
}

// Screens for system info
static lv_obj_t* createInfoScreen(Screens scr, const char* title) {
    lv_obj_t* screen = lv_obj_create(NULL);
    lv_obj_set_width(screen, TFT_WIDTH);
    lv_obj_set_height(screen, TFT_HEIGHT);
    lv_obj_set_align(screen, LV_ALIGN_CENTER);
    setupCommonstyles(screen);
    setupHeader(scr, screen, title);

    // Create a text area to display the info text
    textAreas[scr] = lv_textarea_create(screen);
    lv_obj_set_size(textAreas[scr], TFT_WIDTH, TFT_HEIGHT - (2 * HEIGHT_INFO));
    lv_obj_align(textAreas[scr], LV_ALIGN_CENTER, 0, 0);
    lv_obj_set_style_text_font(textAreas[scr], &UbuntuMonoB16, LV_PART_MAIN | LV_STATE_DEFAULT);

    setupDataMenu(screen);
    return screen;
}

void clockFace(lv_obj_t* parent, uint32_t size);

static lv_obj_t* createClockScreen(Screens scr) {
    lv_obj_t* screen = lv_obj_create(NULL);
    const char* title = "Current Time";

    setupHeader(scr, screen, title);

    lv_obj_set_width(screen, TFT_WIDTH);
    lv_obj_set_height(screen, TFT_HEIGHT);
    lv_obj_set_align(screen, LV_ALIGN_CENTER);
    setupCommonstyles(screen);
    clockFace(screen, TFT_HEIGHT - (2 * TFT_HEIGHT / 8));
    setupDataMenu(screen);
    return screen;
}

// Update the meters. Called regularly from the main loop/task
void metersWork(void) {
    static const uint32_t tick_delay = 100;
    lv_task_handler(); /* let the GUI do its work */
    lv_tick_inc(tick_delay);
}

// Set the value of a meter using a double and precision of 2
void setMeter(Screens scr, MeterIdx idx, double value, const char* units) {
    setMeter(scr, idx, value, units, 2);
}

// Set the value of a meter using a double and set the precision
// Uses the indicator's method which smooths the values
void setMeter(Screens scr, MeterIdx idx, double value, const char* units, uint32_t prec) {
    if (scr >= 0 && scr < SCR_MAX && ind[scr][idx]) {
        ind[scr][idx]->setValue(value, units, prec);
    }
}

void setGauge(Screens scr, double value) {
    static const int needleLength = METER_RADIUS - METER_TICK_LENGTH - 24;  // 24 is the font size for the meters
    if (scr >= 0 && scr < SCR_MAX && gauges[scr] && needles[scr]) {
        lv_scale_set_line_needle_value(gauges[scr], needles[scr], needleLength, (int32_t)value);
//        metersWork();
    }
}

// Set the value of a meter using a string
void setMeter(Screens scr, MeterIdx idx, String& string) {
    if (scr >= 0 && scr < SCR_MAX && ind[scr][idx]) {
        ind[scr][idx]->setValue(string.c_str());
    }
}

// set using a char *
void setMeter(Screens scr, MeterIdx idx, const char* str) {
    if (scr >= 0 && scr < SCR_MAX && ind[scr][idx]) {
        ind[scr][idx]->setValue(str);
    }
}

void setVlabel(Screens scr, String& str) {
    if (scr >= 0 && scr < SCR_MAX && vals[scr]) {
        lv_label_set_text(vals[scr], str.c_str());
    }
}

void setilabel(Screens scr, String& str) {
    if (scr >= 0 && scr < SCR_MAX && infos[scr]) {
        lv_label_set_text(infos[scr], str.c_str());
    }
}

// Load the first screen
void loadScreen() {
    lv_scr_load(screen[SCR_ENGINE]);
}

// Load a numbered screen
void loadScreen(Screens scr) {
    if (scr >= 0 && scr < SCR_MAX) {
        lv_scr_load(screen[scr]);
    }
}

// Update all the clocks in the headers
void updateClocks(const char* t) {
    for (int c = 0; c < SCR_MAX; c++) {
        if (bars[c]) {
            bars[c]->setTime(t);
        }
    }
}

// Check all indicators and set to default value if
// not updated for 10 seconds
#define IND_CHECK_PERIOD 1000   // Milliseconds
#define IND_VALID_PERIOD 10000  // Milliseconds
void checkAllIndicators() {
    static time_t last = 0;
    time_t now = millis();

    // Check every second
    if (now > last + IND_CHECK_PERIOD) {
        last = now;
        for (int scr = 0; scr < SCR_MAX; scr++) {
            for (int i = 0; i < IND_MAX; i++) {
                if (ind[scr][i]) {
                    if (now > ind[scr][i]->lastUpdate + IND_VALID_PERIOD) {
//                        Serial.printf("at %ld clearing %d %d\n", now, scr, i);
                        ind[scr][i]->setValue("---");
                    }
                }
            }
        }
    }
}
